{"meta":{"title":"Yilin Zhao's Web","subtitle":"","description":"","author":"Yilin Zhao","url":"https://lrin-zhao.github.io","root":"/"},"pages":[{"title":"Projects","date":"2021-06-01T02:25:05.000Z","updated":"2022-08-29T01:44:47.215Z","comments":true,"path":"Projects/index.html","permalink":"https://lrin-zhao.github.io/Projects/index.html","excerpt":"","text":"GVIDS 2021/6 - 2022/3· Designed an intelligent vehicular intrusion detection system based on GAN, which can not only detect all the current automobile injection attacks and Dos attacks, but also detect our newly proposed ×× attack.· Responsible for the design and implementation of intrusion detection system, including scheme design, algorithm selection, network structure optimization, experimental evaluation, etc. ClockIDS 2021/2 - 2021/9· Designed an intrusion detection system suitable for automobile CAN bus, and the detection rate was up to 98.39%; At the same time, it can also identify the device controlled by the attacker, with an average recognition rate of 96.41%.· Responsible for system design and implementation, including scheme design, algorithm selection, experimental evaluation, etc. VehicleEIDS 2020/9 - 2021/6 (Chinese Patent)· Designed the vehicle-mounted external intrusion detection system, which is not limited by the means of packet injection by attackers, with an accuracy of up to 97%.· Responsible for system implementation, including calculation and distribution selection and implementation, experimental evaluation, achievement protection, etc."},{"title":"publication","date":"2021-05-31T16:22:59.000Z","updated":"2021-06-01T02:07:48.000Z","comments":true,"path":"Publications/publication.html","permalink":"https://lrin-zhao.github.io/Publications/publication.html","excerpt":"","text":"2021 IoT 2021 Globelcom 2021 IoT"},{"title":"Publications","date":"2021-06-01T02:05:53.000Z","updated":"2022-08-29T01:54:30.618Z","comments":true,"path":"Publications/index.html","permalink":"https://lrin-zhao.github.io/Publications/index.html","excerpt":"","text":"2022● GVIDS: A Reliable Vehicle Intrusion Detection System Based on Generative Adversarial NetworkYilin Zhao, Yijie Xun, Jiajia Liu, Siyu Ma, IEEE GlobeCom 2022 ● ClockIDS: A Real-time Vehicle Intrusion Detection System Based on Clock SkewYilin Zhao, Yijie Xun, Jiajia Liu, IEEE Internet of things Joural, 2022. ● Side Channel Analysis: A Lightweight Intrusion Detection System Based on Vehicle Voltage SignalsYijie Xun, Zhouyan Deng, Jiajia Liu, Yilin Zhao, IEEE Transactions on Vehicular Technology (TVT), 2022 (under reviewed). ● A Lightweight Sender Identification Scheme Based on Vehicle Physical Layer CharacteristicsYijie Xun, Zhouyan Deng, Jiajia Liu, Yilin Zhao, IEEE International Conference on Communications (ICC) 2022. ● A Novel Intrusion Detection System for Next Generation In-Vehicle NetworksZhouyan Deng, Yijie Xun, Jiajia Liu, Shouqing Li, Yilin Zhao, IEEE GlobeCom 2022 2021● VehicleCIDS : An Efficient Vehicle Intrusion Detection System Based on Clock BehaviorYilin Zhao, Yijie Xun, Jiajia Liu, IEEE Global Communications Conference 2021. ● VehicleEIDS: A Novel External Intrusion Detection System Based on Vehicle Voltage SignalsYijie Xun, Yilin Zhao, Jiajia Liu, IEEE Internet of Things Journal, 2021."}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2021-07-01T12:12:05.133Z","updated":"2021-05-31T02:55:20.000Z","comments":true,"path":"2021/07/01/hello-world/","link":"","permalink":"https://lrin-zhao.github.io/2021/07/01/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"My first blog","slug":"My-first-blog","date":"2020-08-18T08:17:07.000Z","updated":"2022-08-29T01:46:01.991Z","comments":true,"path":"2020/08/18/My-first-blog/","link":"","permalink":"https://lrin-zhao.github.io/2020/08/18/My-first-blog/","excerpt":"","text":"About meI received my M.S. degree in computer science and technology from School of Cyber Engineering, Xidian University. My research interests cover in-vehicle network security and deep learning. News2021/10/23 I won a China National Scholarship. Professional ProjectsGVIDS 2021/6 - 2022/3· Designed an intelligent vehicular intrusion detection system based on GAN, which can not only detect all the current automobile injection attacks and Dos attacks, but also detect our newly proposed ×× attack. ClockIDS 2021/2 - 2021/9· Designed an intrusion detection system suitable for automobile CAN bus, and the detection rate was up to 98.39%; it can also identify the device controlled by the attacker, with an average recognition rate of 96.41%. VehicleEIDS 2020/9 - 2021/6 (Chinese Patent)· Designed the vehicle-mounted external intrusion detection system, which is not limited by the means of packet injection by attackers, with an accuracy of up to 97%. Selected Publications● GVIDS: A Reliable Vehicle Intrusion Detection System Based on Generative Adversarial NetworkYilin Zhao, Yijie Xun, Jiajia Liu, Siyu Ma, IEEE GlobeCom 2022 ● ClockIDS: A Real-time Vehicle Intrusion Detection System Based on Clock SkewYilin Zhao, Yijie Xun, Jiajia Liu, IEEE Internet of things Joural, 2022. ● Side Channel Analysis: A Lightweight Intrusion Detection System Based on Vehicle Voltage SignalsYijie Xun, Zhouyan Deng, Jiajia Liu, Yilin Zhao, IEEE Transactions on Vehicular Technology (TVT), 2022 (under reviewed). ● A Lightweight Sender Identification Scheme Based on Vehicle Physical Layer CharacteristicsYijie Xun, Zhouyan Deng, Jiajia Liu, Yilin Zhao, IEEE International Conference on Communications (ICC) 2022. ● A Novel Intrusion Detection System for Next Generation In-Vehicle NetworksZhouyan Deng, Yijie Xun, Jiajia Liu, Shouqing Li, Yilin Zhao, IEEE GlobeCom 2022 ● VehicleCIDS : An Efficient Vehicle Intrusion Detection System Based on Clock BehaviorYilin Zhao, Yijie Xun, Jiajia Liu, IEEE Global Communications Conference 2021. ● VehicleEIDS: A Novel External Intrusion Detection System Based on Vehicle Voltage SignalsYijie Xun, Yilin Zhao, Jiajia Liu, IEEE Internet of Things Journal, 2021. Honors and Awards● China National Scholarship","categories":[],"tags":[]}],"categories":[],"tags":[]}